
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8672701639)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_run_domain_mapping.domain-mapping
* Update
  * google_storage_bucket.public_image_bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_domain_mapping.domain-mapping will be created
  + resource "google_cloud_run_domain_mapping" "domain-mapping" {
      + id       = (known after apply)
      + location = "asia-northeast1"
      + name     = "lgtm.a.shion.pro"
      + project  = "lgtmgen-project"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = (known after apply)
          + generation            = 0
          + namespace             = "lgtmgen-project"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = (known after apply)
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "dev-main-backend"
        }
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":12,"Program":"tfcmt","SHA1":"23c6cf270afbb08211a4846b84b37bd509245828","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->